# Створення пустої множини
empty_set = set()
print("Пуста множина:", empty_set)

# Створення множини за допомогою фігурних дужок
fruits = {"apple", "banana", "cherry"}
print("Множина фруктів:", fruits)

# Створення множини зі списку за допомогою set()
numbers_set = set([1, 2, 3, 1, 4, 1, 4, 5])
print("Множина чисел зі списку:", numbers_set)

# Обчислення кількості різних елементів у довгому списку чисел
numbers = [1, 2, 3, 1, 4, 12, 1, 4, 5, 6, 7, 15, 8, 9, 10, 11, 13, 4, 6, 0]
print("Кількість різних елементів у списку:", len(set(numbers)))

# Обчислення кількості різних букв у довгому рядку
string = "Hello, World! Welcome to Python!"
print("Знаки, які є у рядку:", set(string.lower()))
print("Кількість різних букв у рядку:", len(set(string.lower())))
